---
kind: other
id: Methods.T:Autodesk.Revit.DB.FailuresAccessor
source: html/22e6dbbc-920b-8986-c6e9-10bfb6f8a357.htm
---
# FailuresAccessor Methods

Checks if pending failure processing can be finished by committing a pending transaction.